#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/github-actions/runs/run-yY3ZS9JwMikvpbnx

Waiting for the plan to start...

Terraform v1.0.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=a57b83a38158239d3f74f79f0199c3d9e0c1a207]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=7704865159579916198]
aws_s3_bucket.test_bucket: Refreshing state... [id=mlops-platform-training-data]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=my-lambda1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/my-lambda1"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "my-lambda1"
        }
      + tags_all          = {
          + "Name" = "my-lambda1"
        }
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "my-lambda1-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "my-lambda1"
        }
      + tags_all  = {
          + "Name" = "my-lambda1"
        }
    }

  # module.lambda_function.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "my-lambda1-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "my-lambda1",
        ]
    }

  # module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "My awesome lambda function"
      + filename                       = "builds/a6c7cfe9fc7bfb1cfe42fcf73cc6f53a9766b7a277825966bcd935af69ac8e77.zip"
      + function_name                  = "my-lambda1"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::112227029085:role/my-lambda1"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "my-lambda1"
        }
      + tags_all                       = {
          + "Name" = "my-lambda1"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7704865159579916198" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1627265235985337000" -> "1627787577368642000"
            # (1 unchanged element hidden)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.


```
</details>
*Pusher: @yushindkang, Action: `pull_request`*